{
  "backend/main.mo": "Actor module defining storage maps, access control, notification types, and notification CRUD with timestamps and sorting.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of various frontend source files.",
  "frontend/index.css": "Global Tailwind-based styling with light/dark theme variables and base element styling.",
  "frontend/index.html": "Basic HTML entry file providing root app mount point and loading main.tsx.",
  "frontend/src/App.tsx": "Main app setup configuring authentication-aware layout and full TanStack Router route tree.",
  "frontend/src/components/CollectionCommentsSection.tsx": "Component displaying and creating collection comments with authentication checks, timestamp formatting, and loading states.",
  "frontend/src/components/CollectionPostCard.tsx": "Displays a collection post with image, caption, author info, likes, and expandable comments, using multiple query hooks.",
  "frontend/src/components/CommentsSection.tsx": "Renders comments for a post and provides a form for authenticated users to submit new comments.",
  "frontend/src/components/CreatePostCard.tsx": "Provides a dialog for creating a new post with caption and image upload, including preview and upload progress.",
  "frontend/src/components/DailyPromptCard.tsx": "Shows a daily prompt selected by day of year with static images and styling.",
  "frontend/src/components/DiscussionCommentsSection.tsx": "Handles listing and creating comments for a discussion post, with loading skeletons and user profiles.",
  "frontend/src/components/DiscussionPostCard.tsx": "Displays a discussion post with text, optional image, author info, likes, and expandable comments.",
  "frontend/src/components/EditProfileModal.tsx": "Modal for editing a user's username and bio, handling form state, validation, and profile update mutation.",
  "frontend/src/components/EventCommentsSection.tsx": "Displays and posts comments for an event, including authentication checks, timestamps, and loading states.",
  "frontend/src/components/EventPostCard.tsx": "Card component for an event post showing event details, creator info, image, and a toggleable comments section.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/GroupCommentsSection.tsx": "Handles viewing and creating comments on a group post with member checks, timestamp formatting, and auto‑refresh.",
  "frontend/src/components/GroupMembersDialog.tsx": "Dialog listing group members with admin ability to remove users and view their profiles.",
  "frontend/src/components/GroupPostCard.tsx": "Displays a group post with author info, content, optional image, and a toggleable comments section.",
  "frontend/src/components/Header.tsx": "Renders the main site header with navigation, authentication handling, profile menu, notifications, and mobile menu support.",
  "frontend/src/components/PostCard.tsx": "Displays an individual post with image, author info, likes, emoji reactions, comments, and interactive actions.",
  "frontend/src/components/ProfileCustomizationModal.tsx": "Modal for selecting a profile background and managing up to five favorite tags, with save callbacks.",
  "frontend/src/components/ProfileSetupModal.tsx": "Initial profile setup modal allowing users to set a username and bio and save their profile.",
  "frontend/src/constants/emojiReactions.ts": "Defines the set of allowed emoji reactions with IDs, symbols, and labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for fetching and mutating user profiles, admin state, notifications, and various post types via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables plus custom scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/pages/CollectionsPage.tsx": "Displays collection posts and provides a dialog to create new posts with image uploads and captions.",
  "frontend/src/pages/CommunityPage.tsx": "Shows community groups, supports searching, creating, and joining groups, and navigates to group pages.",
  "frontend/src/pages/DiscussionsPage.tsx": "Lists discussion posts by topic and includes UI to create new text or image-based discussion posts.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and displays events with loading skeletons and fallback when none exist.",
  "frontend/src/pages/GroupDetailPage.tsx": "Displays group details, posts, and membership actions, allowing users to create posts with optional images and admins/creators to delete the group.",
  "frontend/src/pages/HomeFeed.tsx": "Shows the main community feed with hero section, daily prompt, optional post creation, and mood filtering for authenticated users.",
  "frontend/src/pages/MarketplacePage.tsx": "Implements a mock plushie marketplace with listing search and a form to create new listings, currently pending backend integration.",
  "frontend/src/pages/NotificationsPage.tsx": "Fetches and displays user notifications grouped by type, with options to mark individual or all notifications as read.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the authenticated user's profile with posts, achievements, customization options, and editable profile details.",
  "frontend/src/pages/ResourcesPage.tsx": "Renders a resources page with themed guides displayed as cards using static data and UI components.",
  "frontend/src/utils/backendErrors.ts": "Maps backend error messages to simplified, user-friendly text strings.",
  "frontend/src/utils/imagePreprocess.ts": "Resizes, compresses, and converts uploaded images into optimized JPEG byte arrays on the client.",
  "frontend/src/utils/imageUpload.ts": "Validates image files, generates previews, preprocesses images, and enforces upload size limits.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing current state, features, issues, and pending requests related to image upload optimization and reactions."
}