{
  "backend/main.mo": "Main Motoko canister managing posts, comments, profiles, groups, notifications, and access control with helper functions for creating and retrieving notifications.",
  "feature_evidence.json": "Structured feature evidence report mapping feature IDs to affected frontend files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Global Tailwind-based theme variables and dark mode styling definitions applied at the root and element levels.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "App entry setting up authentication-aware layout and full routing tree for all pages using TanStack Router.",
  "frontend/src/components/CollectionCommentsSection.tsx": "UI component for displaying and creating collection comments with user profile lookup, timestamp formatting, and error-handled submission.",
  "frontend/src/components/CollectionPostCard.tsx": "Displays a collection post with image, caption, likes, comments, and author info, and supports liking and toggling comment visibility.",
  "frontend/src/components/CommentsSection.tsx": "Fetches and displays comments for a post and provides an authenticated form to submit new comments.",
  "frontend/src/components/CreatePostCard.tsx": "Provides a dialog-based UI for creating a new post with image upload, caption input, preview, and submission handling.",
  "frontend/src/components/DailyPromptCard.tsx": "Shows a rotating daily prompt selected by day of year with themed styling and a static illustration.",
  "frontend/src/components/DiscussionCommentsSection.tsx": "Displays discussion comments with timestamps and a submission form for authenticated users, including loading skeletons.",
  "frontend/src/components/DiscussionPostCard.tsx": "Renders a discussion post with content, optional image, author info, like support, and an expandable comments section.",
  "frontend/src/components/EditProfileModal.tsx": "Modal form allowing users to edit and save their username and bio using a save profile mutation.",
  "frontend/src/components/EventCommentsSection.tsx": "Displays event comments, lets authenticated users post new comments, and formats timestamps and avatars.",
  "frontend/src/components/EventPostCard.tsx": "Card showing event details, image, creator info, and a toggleable comments section.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution text and a link to caffeine.ai.",
  "frontend/src/components/GroupCommentsSection.tsx": "Renders group comments, allows authenticated users to add comments, and includes timestamp and profile lookup.",
  "frontend/src/components/GroupMembersDialog.tsx": "Dialog listing group members with profile info and admin-only member removal functionality.",
  "frontend/src/components/GroupPostCard.tsx": "Card displaying a group post with author info, content, image, and expandable comments section.",
  "frontend/src/components/Header.tsx": "Navigation header handling auth state, user profile, unread notifications, and mobile/desktop menus.",
  "frontend/src/components/PostCard.tsx": "Displays a post with author info, image, likes, emoji reactions, comments, and interaction handlers.",
  "frontend/src/components/ProfileCustomizationModal.tsx": "Modal for choosing profile background and managing favorite tags with save callbacks.",
  "frontend/src/components/ProfileSetupModal.tsx": "Onboarding modal to create a username and bio, submitting the initial user profile.",
  "frontend/src/constants/emojiReactions.ts": "Defines the list of supported emoji reaction types and their IDs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout logic, and identity state management for the app.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, notifications, admin checks, and various post types using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom color variables for light/dark themes, plus scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/CollectionsPage.tsx": "Renders the collections feed and a dialog for creating new collection posts with image upload support.",
  "frontend/src/pages/CommunityPage.tsx": "Displays community groups with search, creation, and join actions, including admin‑related UI behaviors.",
  "frontend/src/pages/DiscussionsPage.tsx": "Shows discussion threads by topic and provides a modal for creating new discussion posts with optional images.",
  "frontend/src/pages/EventsPage.tsx": "Lists community events and renders skeletons when loading, using EventPostCard for each event.",
  "frontend/src/pages/GroupDetailPage.tsx": "Displays group details, posts, and membership actions, including creating posts with optional images and admin-level deletion.",
  "frontend/src/pages/HomeFeed.tsx": "Renders the main community feed with hero section, daily prompt, post creation, and mood filtering.",
  "frontend/src/pages/MarketplacePage.tsx": "Implements a mock marketplace with listing creation UI, image upload preview, and search, pending backend integration.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows user notifications grouped by type with actions to mark single or all notifications as read.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and customizes the user's profile, shows posts and achievements, and provides editing and styling modals.",
  "frontend/src/pages/ResourcesPage.tsx": "Renders a Resources page listing plushie care, storage, and display guides using cards and icons.",
  "frontend/src/utils/backendErrors.ts": "Converts backend error messages into short, user-friendly strings with specific cases and a fallback.",
  "frontend/src/utils/imagePreprocess.ts": "Resizes and compresses images client-side, returning optimized bytes and metadata before upload.",
  "frontend/src/utils/imageUpload.ts": "Validates, previews, preprocesses, and size-checks images before upload, exposing helpers for image handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL parameters across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, container settings, and plugins for the frontend.",
  "project_state.json": "Describes project state, issues, and feature requests including image upload fixes and username resolution."
}